<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><!-- InstanceBegin template="/Templates/Plantilla.dwt" codeOutsideHTMLIsLocked="false" -->
<head>
<LINK rel=stylesheet href="style.css" type="text/css" title="Radioclub">
<!-- InstanceBeginEditable name="doctitle" -->
<title>Untitled Document</title>
<!-- InstanceEndEditable -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<!-- InstanceBeginEditable name="head" -->
<style type="text/css">
<!--
.style3 {color: #006699}
-->
</style>
<!-- InstanceEndEditable -->
<style type="text/css">
<!--
.style1 {
	color: #000000;
	font-weight: bold;
}
-->
</style>
<link href="style.css" rel="stylesheet" type="text/css">
</head>

<body>
<BASEFONT face=tahoma,verdana,helvetica,arial>
<TABLE cellSpacing=0 cellPadding=0 width=640 align=center bgColor=#ffffff>
  <TBODY>
    <TR>
      <TD class=wide>
        <TABLE cellSpacing=0 cellPadding=0 width=760 bgColor=#ffffff border=0>
          <TBODY>
            <TR>
              <TD class=dow><img 
            src="Imagenes/logo1.jpg" alt=RadioClub border=0 
           align="middle">
              <TD class=dow><img 
            src="Imagenes/logo2.jpg" alt=RadioClub width="400" height="60" border=0 
            align=left> 
            </TR>
          </TBODY>
        </TABLE>
    <TR>
      <TD class=wide>
        <TABLE cellSpacing=0 cellPadding=0 width=760 border=0><!--DWLayoutTable-->
          <TBODY>
            <TR>
              <TD vAlign=top align=left width=130>
                <TABLE cellSpacing=0 cellPadding=0 width=130>
                  <TBODY>
				  <TR>
                      <TD height="63" bgColor=#FFFFFF class=diz>
                        <P class=lin>&nbsp;</P>
                    <TR>
                    <TR>
                      <TD class=diz bgColor=#FF0000>
                        <P class=lin><span class="style1">Apartados </span></P>
                    <TR>
                      <TD class=diz bgColor=#FFCCCC>                        <P class=lst><a href="index.htm">0. Inicio</a> <br>
                        <A 
                  href="Introduccion.htm?enlace=secciones/contenido_index.php">1. Introducci&oacute;n</A><BR>
                          <a href="csound.htm">2. Csound</a></p>
                        <P class=lst> <a href="funciones.htm">2.1 Funciones</a></p>
                        <P class=lst><a href="ejemplo0.htm">2.2. Ejemplos</a><BR>
                          <a href="eco.htm">3. Ecos y Rev.</a><br>
                          <a href="sonido3d.htm">4. Sonido 3D</a><br>
                          <a href="Ejemplos.htm">5.Ejemplos Csound</a><br> 
                          <a href="Bibliografia.htm">6.Bibliograf&iacute;a</a></p>
                        <P class=lst>&nbsp;</p>
                    <TR>
                      <TD class=diz bgColor=#FF0000>
                        <P class=lin><B><FONT color=#d80000>:</FONT>Contacta!!!!!</B></P>
                    <TR>
                      <TD class=diz bgColor=#FFCCCC>
                        <P class=lst> <a href="mailto:jpermar@ribera.tel.uva.es">jpermar@ribera.tel.uva.es </a> </P>
                        <P class=lst> <a href="mailto:acuedie@ribera.tel.uva.es">acuedie@ribera.tel.uva.es </a> <A href="http://www.augcyl.org/" target=_blank></A><br>
                        </P>
                    <TR>
                      <TD class=diz bgColor=#ffffff>
                        <P class=lst><BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                        </P>
                    </TR>
                  </TBODY>
                </TABLE>
              <TD align=left valign="top" bgColor=#ffffff>
                <h2 align="left"><!-- InstanceBeginEditable name="EditRegion3" --><span class="style3">4.0. INTRODUCCI&Oacute;N</span><!-- InstanceEndEditable --> </h2>
                <!-- InstanceBeginEditable name="EditRegion4" -->
                <p align="justify">Imagina que cierras los ojos en la calle, en ese mismo instante comienzas a experimentar un completo mundo en tres dimensiones. Los coches que se mueven, a tu izquierda oyes los pasos de los peatones, las obras de dos calles m&aacute;s arriba, el sonido de los p&aacute;jaros y palomas por encima de ti. En nuestro ambiente natural percibimos los sonidos en tres dimensiones y podemos localizarlos en cualquier instante. En realidad, nuestro cerebro se ha estado entrenando toda la vida, y tenemos memorizados una serie de par&aacute;metros basados en la experiencia y personalizados para cada uno. </p>
                <p align="justify">Sin embargo, en la m&uacute;sica grabada, esto no es as&iacute;. El est&eacute;reo tradicional nos da algo de informaci&oacute;n espacial, pero no lo suficiente para recrear que estamos en una habitaci&oacute;n escuchando un concierto de los Rolling Stones o de la &oacute;pera de Viena. Es m&aacute;s, en vez de dar la sensaci&oacute;n de que est&aacute;s en un espacio tridimensional, la reproducci&oacute;n por altavoces da la sensaci&oacute;n que est&aacute;s en frente de la fuente de sonido. </p>
                <p align="justify" class="style3"><strong>EL ALCANCE DE LA TECNOLOG&Iacute;A 3D AUDIO. </strong></p>
                <p align="justify">Puede ser discutido que los equipos est&eacute;reo tradicionales pueden producir efectos 3D, pero en realidad cuando nos referimos a sonido 3D, normalmente nos referimos a sensaciones espaciales que no se experimentan con el sistema est&eacute;reo. </p>
                <p align="justify">En el caso de altavoces esperamos la posibilidad de situar sonidos fuera de los l&iacute;mites de los altavoces y, de los auriculares, esperamos que el sistema sit&uacute;e los sonidos fuera de la cabeza. </p>
                <p align="justify">La clave del desarrollo en el sonido 3D, se debe al uso del procesado de se&ntilde;al mediante funciones de transferencia dependientes direccionalmente. Te&oacute;ricamente podemos simular todo el espacio en 3D, pero no es tan sencillo. El lento desarrollo de la tecnolog&iacute;a en 3D se debe fundamentalmente a la espera de la aparici&oacute;n de los sistemas digitales que permiten muchas m&aacute;s posibilidades que los sistemas anal&oacute;gicos. </p>
                <p align="justify">El modelo cient&iacute;fico del sonido en 3D ha sido estudiado en la literatura por tres disciplinas, a decir, ac&uacute;stica f&iacute;sica, psicoac&uacute;stica y neuropsicolog&iacute;a auditoria. La <em>ac&uacute;stica f&iacute;sica </em> se centra en las ondas sonoras que alcanzan al receptor desde el pabell&oacute;n aditivo y el fen&oacute;meno ac&uacute;stico que determina sus propiedades espec&iacute;ficas. La <em><strong></strong>psicoac&uacute;stica </em>, estudia la relaci&oacute;n entre las ondas ac&uacute;sticas en el pabell&oacute;n auditivo y la percepci&oacute;n de la imaginaci&oacute;n espacial que experimentan los receptores. La <em>neuropsicolog&iacute;a auditoria </em>, trata la comprensi&oacute;n de las estructuras neuronales que dan sentido a la sensaci&oacute;n del sonido. </p>
                <p align="justify"><span class="style3"><strong>SISTEMAS DE REPRODUCCI&Oacute;N Y GRABACI&Oacute;N DE AUDIO 3D </strong></span><a href="#_ftn1" name="_ftnref1">[1] </a></p>
                <p align="justify">En primer lugar resaltamos que hay varias formas de recrear el sonido 3D, dependiendo de las aplicaciones. As&iacute; veremos los equipos est&eacute;reo, los equipos de varios canales, y los equipos binaurales. Cada uno tiene distintas aplicaciones. As&iacute; por ejemplo las grabaciones binaurales, tienen grandes aplicaciones en el terreno de la realidad virtual, y los sistemas multicanales, dise&ntilde;ados para grandes audiencias, para los cines y equipos caseros simples. </p>
                <p align="justify">El modelo de Surround Sound desarrollado por los brit&aacute;nicos no es el &uacute;nico capaz de producir tal efecto. Hasta ahora ha habido poco en el mercado debido a los pocos equipos existentes para realizar tal t&eacute;cnica. Pero todo esto cambiar&aacute; cuando salga al mercado nuevos equipos dise&ntilde;ados por el Dr. Geoff Barton de 'Ambisonic Technology Centre' de Reading. Este prototipos han sido instalado en un estudio de Crunchfield Manor in Berkshire. Siendo el primer estudio con capacidad de grabar Ambisonic multritack. El formato B (B-Format) es un est&aacute;ndar para se&ntilde;ales Ambisonic que consiste en cuatro se&ntilde;ales con su forma completa, X, W, Y y Z, donde W es una se&ntilde;al mono. X representa delante-atr&aacute;s Y izquierda-derecha, Z arriba-abajo. Como s&oacute;lo se considera sonido surround horizontal (si informaci&oacute;n de altura, al contrario que 'periphony' completa), podemos prescindir de la se&ntilde;al Z. </p>
                <p align="justify">&nbsp; </p>
                <p align="justify">&nbsp; </p>
                <p align="justify">&nbsp;</p>
                <pre align="justify"><em><a href="#_ftnref1" name="_ftn1">[1]</a>Ambisonic mixing- Richard Elen <a href="http://www.york.ac.uk/inst/mustech/3d_audio/elen/ambimix.htm">http://www.york.ac.uk/inst/mustech/3d_audio/elen/ambimix.htm </a></em></pre>
                <pre align="justify">&nbsp;</pre>
                <!-- InstanceEndEditable --><BR>
&nbsp;  <BR>
                <P class=pie align=center>&nbsp;                </P>
                <P class=pie align=center><BR>
&copy; 2004 Ingenier&iacute;a de Ondas </P>              </TR>
          </TBODY>
        </TABLE>
    </TR>
  </TBODY>
</TABLE>

</body>
<!-- InstanceEnd --></html>
