<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><!-- InstanceBegin template="/Templates/Plantilla.dwt" codeOutsideHTMLIsLocked="false" -->
<head>
<LINK rel=stylesheet href="style.css" type="text/css" title="Radioclub">
<!-- InstanceBeginEditable name="doctitle" -->
<title>Untitled Document</title>
<!-- InstanceEndEditable -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<!-- InstanceBeginEditable name="head" -->
<style type="text/css">
<!--
.style3 {color: #006699}
-->
</style>
<!-- InstanceEndEditable -->
<style type="text/css">
<!--
.style1 {
	color: #000000;
	font-weight: bold;
}
-->
</style>
<link href="style.css" rel="stylesheet" type="text/css">
</head>

<body>
<BASEFONT face=tahoma,verdana,helvetica,arial>
<TABLE cellSpacing=0 cellPadding=0 width=640 align=center bgColor=#ffffff>
  <TBODY>
    <TR>
      <TD class=wide>
        <TABLE cellSpacing=0 cellPadding=0 width=760 bgColor=#ffffff border=0>
          <TBODY>
            <TR>
              <TD class=dow><img 
            src="Imagenes/logo1.jpg" alt=RadioClub border=0 
           align="middle">
              <TD class=dow><img 
            src="Imagenes/logo2.jpg" alt=RadioClub width="400" height="60" border=0 
            align=left> 
            </TR>
          </TBODY>
        </TABLE>
    <TR>
      <TD class=wide>
        <TABLE cellSpacing=0 cellPadding=0 width=760 border=0><!--DWLayoutTable-->
          <TBODY>
            <TR>
              <TD vAlign=top align=left width=130>
                <TABLE cellSpacing=0 cellPadding=0 width=130>
                  <TBODY>
				  <TR>
                      <TD height="63" bgColor=#FFFFFF class=diz>
                        <P class=lin>&nbsp;</P>
                    <TR>
                    <TR>
                      <TD class=diz bgColor=#FF0000>
                        <P class=lin><span class="style1">Apartados </span></P>
                    <TR>
                      <TD class=diz bgColor=#FFCCCC>                        <P class=lst><a href="index.htm">0. Inicio</a> <br>
                        <A 
                  href="Introduccion.htm?enlace=secciones/contenido_index.php">1. Introducci&oacute;n</A><BR>
                          <a href="csound.htm">2. Csound</a></p>
                        <P class=lst> <a href="funciones.htm">2.1 Funciones</a></p>
                        <P class=lst><a href="ejemplo0.htm">2.2. Ejemplos</a><BR>
                          <a href="eco.htm">3. Ecos y Rev.</a><br>
                          <a href="sonido3d.htm">4. Sonido 3D</a><br>
                          <a href="Ejemplos.htm">5.Ejemplos Csound</a><br> 
                          <a href="Bibliografia.htm">6.Bibliograf&iacute;a</a></p>
                        <P class=lst>&nbsp;</p>
                    <TR>
                      <TD class=diz bgColor=#FF0000>
                        <P class=lin><B><FONT color=#d80000>:</FONT>Contacta!!!!!</B></P>
                    <TR>
                      <TD class=diz bgColor=#FFCCCC>
                        <P class=lst> <a href="mailto:jpermar@ribera.tel.uva.es">jpermar@ribera.tel.uva.es </a> </P>
                        <P class=lst> <a href="mailto:acuedie@ribera.tel.uva.es">acuedie@ribera.tel.uva.es </a> <A href="http://www.augcyl.org/" target=_blank></A><br>
                        </P>
                    <TR>
                      <TD class=diz bgColor=#ffffff>
                        <P class=lst><BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                        </P>
                    </TR>
                  </TBODY>
                </TABLE>
              <TD align=left valign="top" bgColor=#ffffff>
                <h2 align="left"><!-- InstanceBeginEditable name="EditRegion3" --><span class="style3"><font size="4">4.1. Mecanismos de audici&oacute;n espacial</font></span><a href="#_ftn2" name="_ftnref2"><font size="4"> [2]</font></a><!-- InstanceEndEditable --> </h2>
                <!-- InstanceBeginEditable name="EditRegion4" -->
                <p align="justify"> A continuaci&oacute;n listamos una serie de par&aacute;metros que nuestro o&iacute;do utiliza para localizar la fuente del sonido. Muchos de ellos dependen de cada individuo, as&iacute; como de la forma de su cabeza y de sus distintos miembros. Veremos m&aacute;s adelante como algunos definen la situaci&oacute;n vertical, otros la e izquierda derecha, como otros dependen de la frecuencia, etc. </p>
                <p align="justify">Seg&uacute;n <em>Begault </em>, hay ocho caracter&iacute;sticas por las que localizamos el sonido, estas son&nbsp; Diferencia de tiempos interaurales (Interaural time difference &oacute; ITD), el movimiento de la cabeza y movimiento de la fuente, la respuesta del pabell&oacute;n auditivo (caracter&iacute;sticas de ITD e IID ambiguas, HRTF, localizaci&oacute;n con caracter&iacute;sticas HRTF), caracter&iacute;stica de la distancia (Intensidad, volumen, influencia de la familiaridad, caracter&iacute;sticas espectrales y binaurales para la distancia), reverberaci&oacute;n. A continuaci&oacute;n describimos los aspectos m&aacute;s importantes: </p>
                <ol>
                  <li>El tiempo de llegada del frente de onda a los o&iacute;dos o, mejor dicho, la diferencia de los tiempos de llegada entre los dos o&iacute;dos es uno de los mecanismos usados por nuestro sistema auditivo para localizar una fuente de sonido. Este tiempo se conoce como <strong>ITD (Interaural Time Difference)</strong>. Este efecto es &uacute;til hasta una frecuencia en la que la longitud de onda del sonido se aproxima al doble de la distancia entre los dos o&iacute;dos, a partir del cual, no se diferencia un sonido de otro. Este tiempo de llegada del sonido, nos permite localizar el sonido en un &aacute;ngulo horizontal 90&ordm; (derecha)-270&ordm; (izquierda). Parece ser efectivo a frecuencias por debajo de los 900Hz
                  <li>El sonido de una fuente que venga de la izquierda (por ejemplo) llegar&aacute; primero al odio izquierdo, pero tendr&aacute; que viajar hasta el otro lado. En realidad lo que ocurre, es que el sonido es difractado alrededor de la cabeza para llegar al o&iacute;do derecho y por lo tanto tendr&aacute; que viajar m&aacute;s. Este tiempo se llama <strong>(ILD) Interaural Time Loudness Difference</strong>, que abarca tanto el efecto pantalla de la cabeza como el debido a la distancia extra que recorre. </li>
               
                  <p align="justify">Ambos el ITD, y el ILD se describe con con m&aacute;s atenci&oacute;n m&aacute;s adelante. </p>
               
                  <li>Cuando los ITD's y ILD's son pr&aacute;cticamente los mismos, entra en juego otro factor, el <strong>HRTF (Head Related Tranfer Functions)</strong> . Esto ocurre cuando el sonido est&aacute; localizado en el plano medio. De tal modo, que parece que la localizaci&oacute;n se lleva a cabo con la convoluci&oacute;n de la se&ntilde;al y de la forma de nuestro torso superior, cabeza, cuello y nuestras orejas. La informaci&oacute;n recogida es &uacute;til para determinar tanto la elevaci&oacute;n como la localizaci&oacute;n trasera o delantera. Para estas funciones tenemos toda una secci&oacute;n dedicada. <a href="#_ftn3" name="_ftnref3">[3] </a>
                  <li><strong>Distancia :</strong><ul><li><strong>El volumen</strong>: aunque parezca muy sencillo, el volumen de un sonido es un par&aacute;metro poco fiable para la localizaci&oacute;n del sonido.&iquest;por qu&eacute;? Sabemos que la energ&iacute;a ac&uacute;stica cae inversamente al cuadrado de la distancia, pero cuando manejamos s&oacute;lo amplitudes (como por ejemplo en los ordenadores) no es lo mismo que la impresi&oacute;n de volumen . Esto es debido a que el volumen no est&aacute; linealmente relacionado con la amplitud y es muy dependiente de nuestro conocimiento adquirido del comportamiento de las fuentes sonoras que lo crean. (no creemos que una persona murmurando a nuestro lado tiene m&aacute;s volumen que un amigo nuestro gritando a muchos metros de nosotros)</li>
                      <li><strong>Proporcionalidad entre Reverberaci&oacute;n y sonido seco</strong> : En habitaciones cerradas, la energ&iacute;a de una densa reverberaci&oacute;n ser&aacute; m&aacute;s o menos constante, mientras que en distancias largas la energ&iacute;a que un sonido directo (seco, sin reverberaci&oacute;n) caer&aacute; con la distancia. Parece ser que es el mayor responsable en nuestro juicio de distancia en sitios reverberantes.
                  <li><strong>Absorci&oacute;n de las altas frecuencias</strong>, que tiene que ver con los gases del aire. Este efecto es similar a un filtro paso bajo, y se considera relevante a distancias mayores que 50 metros.
                  <li><strong>Tiempo de reverberaci&oacute;n</strong>: El mismo nombre lo dice.
                  <li><strong>Balance espectral</strong>: Las habitaciones act&uacute;an como filtros, modificando el espectro de las se&ntilde;ales ac&uacute;sticas. El espectro de la respuesta al impulso de una habitaci&oacute;n buena, debe ser lo suficientemente planta en todo el ancho de banda de la se&ntilde;al.
                  <li><strong>Difusi&oacute;n:</strong> tiene que ver con la absorci&oacute;n de los materiales, normalmente las frecuencias altas caen m&aacute;s r&aacute;pidamente.
                  </ul>
                  <li>Nuestra habilidad para <strong>mover la cabeza</strong> nos ayuda para integrar la informaci&oacute;n visual y auditiva. <a href="#_ftn4" name="_ftnref4">[4] </a>Adem&aacute;s, nos sirve para minimizar el ITD, ILD y la diferencia entre las HRTFs de los dos o&iacute;dos.
                  <li>El <strong>efecto Dopler</strong> tambi&eacute;n importante en la localizaci&oacute;n. As&iacute; observamos c&oacute;mo el tono de la fuente en movimiento, aumenta o disminuye seg&uacute;n se aleja o se acerca, increment&aacute;ndose o disminuyendo respectivamente. <a href="#_ftn5" name="_ftnref5">[5] </a> Este hecho se puede encontrar en cualquier libro de fundamentos f&iacute;sicos de primer curso de ingenier&iacute;a.
                  <li>"<strong>The precedente Effect o el Efecto Hass</strong>" . Este efecto explica como somos capaces de localizar una fuente aunque seamos confundidos por las reflexiones y los ecos. (la ley del primer frente de ondas " the law of the first wavefront "). En realidad discernimos entre ellos y somos capaces de localizar la fuente del sonido, y veremos m&aacute;s adelante c&oacute;mo estos efectos hacen que percibamos en qu&eacute; tipo de ambiente estamos. </li>
                
                  <div align="center"><img width="215" height="201" src="Imagenes/image001.gif">
                    </p>
                  </div>
                  <li> La <strong>forma que la fuente emite el sonid</strong>o, una fuente que irradia energ&iacute;a de igual manera en todas las direcciones se considera omni-direccional. Esto es una idealizaci&oacute;n, puesto que normalmente no es as&iacute;. As&iacute;, la recepci&oacute;n del sonido es distinta si la fuente emite hacia un lado u otro.  </li>
                </ol>
                
                <p align="justify"><font size="4">&nbsp; </font></p>
                <pre align="justify"><em><a href="#_ftnref2" name="_ftn2">[2]</a>Spatial hearing mechanisns and sound reproduction. D.G. Malham, University of York, England 1998. </em></pre>
                <pre align="justify"><em><a href="http://www.york.ac.uk/inst/mustech/3d_audio/ambis2.htm">http://www.york.ac.uk/inst/mustech/3d_audio/ambis2.htm </a></em></pre>
                <pre align="justify"><em><a href="#_ftnref3" name="_ftn3">[3]</a> Spatial listening and its computer simulation on electronic Music. </em></pre>
                <pre align="justify"><em><a href="http://musica.unq.edu.ar/personales/odiliscia/papers/spatial-listening.htm">http://musica.unq.edu.ar/personales/odiliscia/papers/spatial-listening.htm </a></em></pre>
                <pre align="justify"><em><a href="#_ftnref4" name="_ftn4">[4]</a> Csound Book. Pag. 496 </em></pre>
                <pre align="justify"><em><a href="#_ftnref5" name="_ftn5">[5]</a> Csound Book Pag 497 </em></pre>
                <!-- InstanceEndEditable --><BR>
&nbsp;  <BR>
                <P class=pie align=center>&nbsp;                </P>
                <P class=pie align=center><BR>
&copy; 2004 Ingenier&iacute;a de Ondas </P>              </TR>
          </TBODY>
        </TABLE>
    </TR>
  </TBODY>
</TABLE>

</body>
<!-- InstanceEnd --></html>
