<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><!-- InstanceBegin template="/Templates/Plantilla.dwt" codeOutsideHTMLIsLocked="false" -->
<head>
<LINK rel=stylesheet href="style.css" type="text/css" title="Radioclub">
<!-- InstanceBeginEditable name="doctitle" -->
<title>Untitled Document</title>
<!-- InstanceEndEditable -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<!-- InstanceBeginEditable name="head" -->
<style type="text/css">
<!--
.style3 {color: #006699}
-->
</style>
<style type="text/css">
<!--
.style4 {font-weight: bold}
-->
</style>
<!-- InstanceEndEditable -->
<style type="text/css">
<!--
.style1 {
	color: #000000;
	font-weight: bold;
}
-->
</style>
<link href="style.css" rel="stylesheet" type="text/css">
</head>

<body>
<BASEFONT face=tahoma,verdana,helvetica,arial>
<TABLE cellSpacing=0 cellPadding=0 width=640 align=center bgColor=#ffffff>
  <TBODY>
    <TR>
      <TD class=wide>
        <TABLE cellSpacing=0 cellPadding=0 width=760 bgColor=#ffffff border=0>
          <TBODY>
            <TR>
              <TD class=dow><img 
            src="Imagenes/logo1.jpg" alt=RadioClub border=0 
           align="middle">
              <TD class=dow><img 
            src="Imagenes/logo2.jpg" alt=RadioClub width="400" height="60" border=0 
            align=left> 
            </TR>
          </TBODY>
        </TABLE>
    <TR>
      <TD class=wide>
        <TABLE cellSpacing=0 cellPadding=0 width=760 border=0><!--DWLayoutTable-->
          <TBODY>
            <TR>
              <TD vAlign=top align=left width=130>
                <TABLE cellSpacing=0 cellPadding=0 width=130>
                  <TBODY>
				  <TR>
                      <TD height="63" bgColor=#FFFFFF class=diz>
                        <P class=lin>&nbsp;</P>
                    <TR>
                    <TR>
                      <TD class=diz bgColor=#FF0000>
                        <P class=lin><span class="style1">Apartados </span></P>
                    <TR>
                      <TD class=diz bgColor=#FFCCCC>                        <P class=lst><a href="index.htm">0. Inicio</a> <br>
                        <A 
                  href="Introduccion.htm?enlace=secciones/contenido_index.php">1. Introducci&oacute;n</A><BR>
                          <a href="csound.htm">2. Csound</a></p>
                        <P class=lst> <a href="funciones.htm">2.1 Funciones</a></p>
                        <P class=lst><a href="ejemplo0.htm">2.2. Ejemplos</a><BR>
                          <a href="eco.htm">3. Ecos y Rev.</a><br>
                          <a href="sonido3d.htm">4. Sonido 3D</a><br>
                          <a href="Ejemplos.htm">5.Ejemplos Csound</a><br> 
                          <a href="Bibliografia.htm">6.Bibliograf&iacute;a</a></p>
                        <P class=lst>&nbsp;</p>
                    <TR>
                      <TD class=diz bgColor=#FF0000>
                        <P class=lin><B><FONT color=#d80000>:</FONT>Contacta!!!!!</B></P>
                    <TR>
                      <TD class=diz bgColor=#FFCCCC>
                        <P class=lst> <a href="mailto:jpermar@ribera.tel.uva.es">jpermar@ribera.tel.uva.es </a> </P>
                        <P class=lst> <a href="mailto:acuedie@ribera.tel.uva.es">acuedie@ribera.tel.uva.es </a> <A href="http://www.augcyl.org/" target=_blank></A><br>
                        </P>
                    <TR>
                      <TD class=diz bgColor=#ffffff>
                        <P class=lst><BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                        </P>
                    </TR>
                  </TBODY>
                </TABLE>
              <TD align=left valign="top" bgColor=#ffffff>
                <h2 align="left"><!-- InstanceBeginEditable name="EditRegion3" --><span class="style3"><font size="4" face="Comic Sans MS">4.2. SISTEMAS DE COORDENADAS EMPLEADOS </font></span><!-- InstanceEndEditable --> </h2>
                <!-- InstanceBeginEditable name="EditRegion4" -->
                <p align="justify" class="style3">&nbsp;</p>
                <p align="justify"><font size="4">Para especificar la localizaci&oacute;n de un sonido, necesitamos un sistema de coordenadas. Una elecci&oacute;n natural, es un que est&eacute; centrado en la cabeza, como el mostrado m&aacute;s abajo. Los tres ejes coordenados definen tres planos est&aacute;ndar x-y el plano horizontal, x-z el plano frontal, y el y-z el plano mediano. Definiendo, arriba/abajo, delante/atr&aacute;s y derecha/izquierda respectivamente. Pero puesto como la cabeza es como una esfera se usan coordenadas esf&eacute;ricas, donde tenemos azimut , elevaci&oacute;n y radio . Desafortunadamente hay m&aacute;s de una manera de definir estas coordenadas; definimos fa continuaci&oacute;n dos sistemas de coordenadas empleados: </font> </p>
                <p align="justify"><font size="4"><strong>&quot;Vertical-polar coordinate system&quot; :</strong> En este sistema primero se mide el azimut como el &aacute;ngulo desde el plano mediano al plano vertical que contiene la fuente y el plano z, y luego se mide la elevaci&oacute;n, que parte desde el plano horizontal. Desde este punto de vista, las superficies con azimut constante son planos que pasan a trav&eacute;s del eje z, y las superficies con elevaci&oacute;n constante, son conos conc&eacute;ntricos alrededor del eje z. </font> </p>
                <p align="justify"><font size="4"><strong>&quot;Interaural-polar coordinate system&quot; :</strong> primero se mide la elevaci&oacute;n como el &aacute;ngulo que va desde el plano horizontal hasta un plano que contiene el eje x y la fuente Con esta elecci&oacute;n las superficies de elevaci&oacute;n constante son planos alrededor del plano inter-aural. (x) y superficies con azimut constante son conos conc&eacute;ntricos con el eje Interaural. </font> </p>
                <p align="center"><img width="228" height="192" src="Imagenes/image004.gif"></p>
                <p align="center"><img width="499" height="212" src="Imagenes/image005.gif"></p>
                <p align="justify"><em style="font-style: normal"><span class="style4"><font size="4">Usos:</font><font size="5"> </font></span> </em></p>
                <p align="justify"><font size="4">1. El " <em>vertical-polar system" </em> es el m&aacute;s conveniente para describir fuentes que est&aacute;n en el plano horizontal, cuando azimut var&iacute;a entre (-180&ordm;, +180&ordm;) </font> </p>
                <p align="justify"><font size="4">2. Con el sistema " <em>interaural-polar system" </em>, el azimut est&aacute; siempre entre -90 y +90. La distinci&oacute;n entre adelante y atr&aacute;s, es 0 para superficies en el plano horizontal y 180 para superficies en la parte de atr&aacute;s del plano horizontal. </font> </p>
                <p align="justify">&nbsp; </p>
                <p align="center"><img width="228" height="166" src="Imagenes/image006.gif"><img width="186" height="133" src="Imagenes/image007.gif"><br>
                </p>
                <p align="justify">&nbsp; </p>
                <p align="justify" class="style3"><font size="4" face="Comic Sans MS">A. AZIMUT (ILD, ITD) </font> </p>
                <p align="justify"><font size="4">Uno de los pioneros en investigar la audici&oacute;n espacial fue Lord Rayleigh. Hace 100 a&ntilde;os desarrollo la teor&iacute;a d&uacute;plex ("D&uacute;plex Theory"). Seg&uacute;n esta teor&iacute;a se definen ITD y ILD. </font> </p>
                <p align="center"><img width="213" height="218" src="Imagenes/image008.gif"></p>
                <p align="justify"><font size="4">Lord Rayleigh ten&iacute;a una explicaci&oacute;n sencilla para el <strong>ITD</strong>. El sonido se propaga a una velocidad de c de unos 343 m/s. Si una onda llega a una superficie esf&eacute;rica con un &aacute;ngulo azimut de tita, l&oacute;gicamente el sonido llega primero a la oreja derecha que a la izquierda, pues tiene que viajar una distancia superior para llegar a la oreja izquierda. Si lo dividimos por la velocidad del sonido, obtenemos la f&oacute;rmula: </font> </p>
                <p align="center"><img width="211" height="29" src="Imagenes/image009.gif"></p>
                <p align="justify"><font size="4">As&iacute;, ITD es cero cuando la fuente esta directamente en frente, y tiene un m&aacute;ximo <img width="66" height="17" src="Imagenes/image010.gif">cuando la fuente est&aacute; en un lado. Esto representa una diferencia de 0.7ms para un tama&ntilde;o t&iacute;pico de cabeza.</font> </p>
                <p align="justify"><font size="4">Pero tambi&eacute;n observ&oacute; que una onda incidente se difracta en la cabeza. De hecho, resolvi&oacute; la ecuaci&oacute;n de onda que mostraba como una onda plana era difractada por una esfera r&iacute;gida. Su soluci&oacute;n mostraba que adem&aacute;s del ITD hab&iacute;a otra diferencia entre el nivel de la se&ntilde;al en ambos o&iacute;dos. <strong>El ILD</strong>. Como se puede esperar ILD depende fuertemente de la frecuencia. A frecuencias bajas, donde la longitud de onda del sonido es m&aacute;s grande que el di&aacute;metro de la cabeza, hay poca diferencia de presi&oacute;n sonora en las dos orejas, sin embargo, a altas frecuencias, donde la longitud de onda es peque&ntilde;a, puede haber 20dB o m&aacute;s de diferencia. Esto se conoce como head-shadow effect. </font> </p>
                <p align="justify"><font size="4">La teor&iacute;a d&uacute;plex, dice que el ILD y el ITD son complementarios. A bajas frecuencias (1.5 Khz) hay poco ILD, pero ITD es apreciable. Mientras que a altas frecuencias hay ambig&uuml;edad en el ITD, pero el ILD resuelve esta ambig&uuml;edad. </font> </p>
                <p align="left" class="style3"><font size="4" face="Comic Sans MS">B. ELEVACI&Oacute;N (HTRF)</font></p>
                <p align="justify"><font size="4">El pabell&oacute;n auditivo act&uacute;a como una cavidad de resonancia, donde amplifica algunas frecuencias, y su geometr&iacute;a genera ciertos efectos de interferencia que aten&uacute;an otras frecuencias. Dicho de otra forma, su respuesta en frecuencia depende de la direcci&oacute;n. La figura de abajo mide las respuestas en frecuencia de dos direcciones distintas. En ambos casos vemos los caminos que han seguido las ondas. </font> </p>
                <p align="justify"><font size="4">A frecuencias elevadas, la se&ntilde;al directa est&aacute; en desfase con la se&ntilde;al que llega m&aacute;s tarde. La mayor interferencia ocurre, cuando la diferencia de recorrido d es la mitad de la longitud de onda. Por ejemplo si F=c/2D,. Como el pabell&oacute;n auditivo es mucho m&aacute;s efectivo con sonidos que vienen de la parte delantera, este efecto es por lo tanto mucho m&aacute;s pronunciado.. </font> </p>
                <p align="center"><img width="343" height="293" src="Imagenes/image011.gif"></p>
                <p align="justify">&nbsp; </p>
                <p align="justify"><span class="style3"><font size="4">C. </font> <font face="Comic Sans MS" size="4">RADIODISTACIA</font> </span> </p>
                <p align="justify"><font size="4">En realidad somos muy malos a la hora de decir como de lejos est&aacute; el sonido. Hay ciertos par&aacute;metros que se pueden tener en cuenta. </font> </p>
                <p align="justify"><font size="4">Los t&eacute;rminos que utilizamos son ingleses, pues </font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; Loudness </font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; Motion parallax: Movimientos de la cabeza</font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; Excess interaural level difference (ITLD): Exceso de la diferecincia de los tiempos interaurales.</font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; La raz&oacute;n entre el sonido directo y el reverberado.</font> </p>
                <p align="justify"><font size="4">&nbsp; </font> </p>
                <p align="justify"><font size="4"><strong>Loudness:</strong> Intensidad de sonido . </font></p>
                <p align="justify"><font size="4"><strong>Motion parallax:</strong> esto se refiere a los movimientos de cabeza. El mover la cabeza cambian los par&aacute;metros azimut, y estos son dependientes de lo lejos que est&eacute; la fuente. As&iacute; para fuentes sonoras que est&aacute;n cercanas al receptor, se observa un cambio grande en en las variables azimut, mientras que para fuentes lejanas, es inapreciable o simplemente no cambia. </font> </p>
                <p align="justify"><font size="4">As&iacute; mismo, para Fuentes cercanas, el ILD aumentar&aacute;. Este incremento es notable cuando la fuente est&aacute; a una distancia de un metro.<span lang="es"> </span>Un caso extremo es cuando un insecto nos ronda la cabeza, o cuando alguien nos susurra al o&iacute;do. Normalmente que oigamos un sonido s&oacute;lo en un o&iacute;do es muy desagradable, esto hay que tenerlo en cuenta, pues si queremos simular que el sonido proviene de una lado, no hace falta que s&oacute;lo se oiga de ese lado, sino que se puede escuchar en el otro, siendo as&iacute; m&aacute;s agradable y m&aacute;s real. </font> </p>
                <p align="justify"><font size="4">Otra caracter&iacute;stica que nuestro o&iacute;do utiliza para localizar los sonidos es la raz&oacute;n de reverberaci&oacute;n con la fuente el sonido directo. Esto tiene que ver con las reflexiones del sonido en las paredes de una habitaci&oacute;n. Norm<span lang="es">a</span>lmente, la intensidad del sonido cae con el cuadrado de la distancia, pero cuando existen reverberaciones las cosas cambian. A distancias cortas la reverberaci&oacute;n es bastante grande, mientras que a distancias largas este ratio es m&aacute;s peque&ntilde;o.</font></p>
                <!-- InstanceEndEditable --><BR>
&nbsp;  <BR>
                <P class=pie align=center>&nbsp;                </P>
                <P class=pie align=center><BR>
&copy; 2004 Ingenier&iacute;a de Ondas </P>              </TR>
          </TBODY>
        </TABLE>
    </TR>
  </TBODY>
</TABLE>

</body>
<!-- InstanceEnd --></html>
