<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><!-- InstanceBegin template="/Templates/Plantilla.dwt" codeOutsideHTMLIsLocked="false" -->
<head>
<LINK rel=stylesheet href="style.css" type="text/css" title="Radioclub">
<!-- InstanceBeginEditable name="doctitle" -->
<title>Untitled Document</title>
<!-- InstanceEndEditable -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<!-- InstanceBeginEditable name="head" -->
<style type="text/css">
<!--
.style2 {
	color: #006699;
	font-weight: bold;
}
-->
</style>
<style type="text/css">
<!--
.style3 {color: #006699}
-->
</style>
<!-- InstanceEndEditable -->
<style type="text/css">
<!--
.style1 {
	color: #000000;
	font-weight: bold;
}
-->
</style>
<link href="style.css" rel="stylesheet" type="text/css">
</head>

<body>
<BASEFONT face=tahoma,verdana,helvetica,arial>
<TABLE cellSpacing=0 cellPadding=0 width=640 align=center bgColor=#ffffff>
  <TBODY>
    <TR>
      <TD class=wide>
        <TABLE cellSpacing=0 cellPadding=0 width=760 bgColor=#ffffff border=0>
          <TBODY>
            <TR>
              <TD class=dow><img 
            src="Imagenes/logo1.jpg" alt=RadioClub border=0 
           align="middle">
              <TD class=dow><img 
            src="Imagenes/logo2.jpg" alt=RadioClub width="400" height="60" border=0 
            align=left> 
            </TR>
          </TBODY>
        </TABLE>
    <TR>
      <TD class=wide>
        <TABLE cellSpacing=0 cellPadding=0 width=760 border=0><!--DWLayoutTable-->
          <TBODY>
            <TR>
              <TD vAlign=top align=left width=130>
                <TABLE cellSpacing=0 cellPadding=0 width=130>
                  <TBODY>
				  <TR>
                      <TD height="63" bgColor=#FFFFFF class=diz>
                        <P class=lin>&nbsp;</P>
                    <TR>
                    <TR>
                      <TD class=diz bgColor=#FF0000>
                        <P class=lin><span class="style1">Apartados </span></P>
                    <TR>
                      <TD class=diz bgColor=#FFCCCC>                        <P class=lst><a href="index.htm">0. Inicio</a> <br>
                        <A 
                  href="Introduccion.htm?enlace=secciones/contenido_index.php">1. Introducci&oacute;n</A><BR>
                          <a href="csound.htm">2. Csound</a></p>
                        <P class=lst> <a href="funciones.htm">2.1 Funciones</a></p>
                        <P class=lst><a href="ejemplo0.htm">2.2. Ejemplos</a><BR>
                          <a href="eco.htm">3. Ecos y Rev.</a><br>
                          <a href="sonido3d.htm">4. Sonido 3D</a><br>
                          <a href="Ejemplos.htm">5.Ejemplos Csound</a><br> 
                          <a href="Bibliografia.htm">6.Bibliograf&iacute;a</a></p>
                        <P class=lst>&nbsp;</p>
                    <TR>
                      <TD class=diz bgColor=#FF0000>
                        <P class=lin><B><FONT color=#d80000>:</FONT>Contacta!!!!!</B></P>
                    <TR>
                      <TD class=diz bgColor=#FFCCCC>
                        <P class=lst> <a href="mailto:jpermar@ribera.tel.uva.es">jpermar@ribera.tel.uva.es </a> </P>
                        <P class=lst> <a href="mailto:acuedie@ribera.tel.uva.es">acuedie@ribera.tel.uva.es </a> <A href="http://www.augcyl.org/" target=_blank></A><br>
                        </P>
                    <TR>
                      <TD class=diz bgColor=#ffffff>
                        <P class=lst><BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                        </P>
                    </TR>
                  </TBODY>
                </TABLE>
              <TD align=left valign="top" bgColor=#ffffff>
                <h2 align="left"><!-- InstanceBeginEditable name="EditRegion3" --><span class="style2"><font face="Comic Sans MS" size="5">4.5. Sistemas basados en HRTF.</font></span><!-- InstanceEndEditable --> </h2>
                <!-- InstanceBeginEditable name="EditRegion4" -->
                <p><b></b></p>
                <p align="justify"> <font size="4">Los sistemas basados en las funciones de transferencia HRTF, son capaces de simular elevaci&oacute;n, distancia y azimut. Esto significa que al menos en principio pueden crear la impresi&oacute;n de un sistema en 3D. En la pr&aacute;ctica es algo distinto, debido a las diferencias entre las personas y las limitaciones computacionales, es mucho m&aacute;s sencillo, controlar el azimut que la elevaci&oacute;n y la distancia. A&uacute;n as&iacute;, los sistemas basados en HRTF est&aacute;n convirti&eacute;ndose en un est&aacute;ndar para sistemas avanzados de 3D. </font> </p>
                <p align="justify"><font size="4">Primeramente hacemos una peque&ntilde;a descripci&oacute;n del “convolotron”, que es un conocido sistema 3D desarrollado por la NASA. Describiremos algunas caracter&iacute;sticas y terminaremos con distintos modelos HRTF elaborados. </font> </p>
                <ul>
                  <li>
                    <p align="justify"><font size="4">El Convolvotron </font>                 
                  </li>
                  <li>
                    <p align="justify"><font size="4">Auriculares versus Altavoces </font>                 
                  </li>
                  <li>
                    <p align="justify"><font size="4">La necesidad de posicionar la cabeza </font>                 
                  </li>
                  <li>
                    <p align="justify"><font size="4">Versiones modeladas y experimentales de HRTF's </font>                 
                  </li>
                  <li>
                    <p align="justify"><font size="4">Modelos para HRTF's </font>                 
                  </li>
                </ul>
                <blockquote>
                  <p>&nbsp;</p>
                </blockquote>
                <p align="center"> <img border="0" src="Imagenes/image020.jpg" width="324" height="220"></p>
                <p align="center"><span lang="EN-GB"> <font size="3">Measuring the HRTF of a KEMAR manikin</font></span></p>
                <p align="justify">&nbsp;</p>
                <h1><span class="style3"><font size="5" face="Comic Sans MS">El Convolotr&oacute;n.</font></span>  </h1>
                <p align="center"><img width="204" height="257" src="Imagenes/hrtf_clip_image001.gif"></p>
                <p align="justify"><font size="4">El Convolotron, manufacturado por Cristal River Engineerin, es una manera simple de usar HRTF para el audio especial. Esencialmente consiste en dos convolucionadores cada uno de los cuales convoluciona una misma se&ntilde;al de audio con una respuesta al impulso discreta de la cabeza (Head-related impulse response-HDIR) cogidos de una tabla de valores previamente medidos. La salida va directamente a los auriculares del usuario. </font> </p>
                <p align="justify"><font size="4">Si la HRIR's es suficientemente parecida a la del usuario, entonces obtendremos unos resultados aceptables, la idea b&aacute;sica de funcionamiento </font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; Podemos recrear muchas fuentes haciendo lo mismo para cada fuente. </font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; Podemos tomar en cuenta el movimiento de la cabeza, monitorizando por alg&uacute;n sistema la posici&oacute;n de la cabeza y modificando seg&uacute;n la posici&oacute;n de la misma las funciones HRIR's, dando as&iacute; una sensaci&oacute;n de que el usuario se mueve totalmente en un ambiente en 3D y no es simplemente un observador est&aacute;tico en donde el ambiente se mueve con &eacute;l, consiguiendo as&iacute; un efecto mucho m&aacute;s real. </font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; Las tablas las podemos crear teniendo en cuenta solamente los par&aacute;metros de azimut y elevaci&oacute;n, dejando la distancia de la fuente (distinta para cada o&iacute;do) para utilizar efectos de rango/amplitud. </font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; El n&uacute;mero de HRIR's almacenados previamente puede reducirse dr&aacute;sticamente analizando unas funciones HRIR's cr&iacute;ticas en el espacio y posteriormente hacer una interpolaci&oacute;n para hallar el resto. Esto es, recordemos que dependiendo de la posici&oacute;n de la cabeza y de la fuente tendremos unas HRIR's distintas, as&iacute; pues resulta muy engorroso hacer un muestreo de todo (si acaso impracticable). </font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; Los ecos y la reverberaci&oacute;n de la habitaci&oacute;n se pueden a&ntilde;adir incluyendo un modelo simulado de una habitaci&oacute;n. </font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; El sistema puede ser personalizado para un individuo particular midiendo y usando las funciones HRIR's de dicha persona. </font> </p>
                <p align="justify"><font size="4">Sin embargo, no importa como implementemos el esquema, la idea principal es generar unas se&ntilde;ales adecuadas para ambas orejas con una convoluci&oacute;n a tiempo real de la se&ntilde;al original monoaural, con unas tablas tabuladas de respuesta al impulso (HRIR's). </font> </p>
                <h1 class="style3"><font size="5" face="Comic Sans MS">Auriculares vs Altavoces</font> </h1>
                <p align="justify"><font size="4">Los auriculares simplifican el problema de enviar distintas se&ntilde;ales a cada o&iacute;do pero sin embargo presentan graves inconvenientes, sobretodo en el campo de la realidad virtual. As&iacute; podemos enumerar algunos de ellos: </font> </p>
                <ul>
                  <ol>
                    <ol>
                      <li>
                        <p align="justify"><font size="4">A mucha gente no le gusta los auriculares, son inc&oacute;modos incluso si son inal&aacute;mbricos. Adem&aacute;s los mejores (ac&uacute;sticamente hablando) son inc&oacute;modos para llevar durante per&iacute;odos largos de tiempo. Adem&aacute;s, aten&uacute;an los sonidos externos y a&iacute;slan socialmente al usuario. </font>                 
                      </li>
                      <li>
                        <p align="justify"><font size="4">La respuesta en frecuencia de los auriculares pueden tener picos y cortes que se parezcan a las respuestas del pabell&oacute;n auditivo (pinna en ingl&eacute;s). Estos efectos si no se compensan adecuadamente pueden dar problemas en los par&aacute;metros de elevaci&oacute;n. </font>                 
                      </li>
                      <li>
                        <p align="justify"><font size="4">Los sonidos en los auriculares dan la impresi&oacute;n de estar demasiado cerca (y en realidad lo est&aacute;). Adem&aacute;s los efectos utilizados para dar<span lang="es"> </span>una localizaci&oacute;n del sonido es muy sensible a la posici&oacute;n del auricular. </font>                 
                      </li>
                    </ol>
                  </ol>
                </ul>
                <p align="justify">&nbsp; </p>
                <p align="justify">&nbsp; </p>
                <p align="justify"><font size="4">Los altavoces resuelven la mayor parte de estos problemas, pero no est&aacute; muy claro como dar un sonido binaural. Una soluci&oacute;n es una t&eacute;cnica llamada cross-talk-cancelled stereo (or transaural stereo)</font> </p>
                <p>&nbsp; </p>
                <p align="center"><img width="290" height="201" src="Imagenes/hrtf_clip_image002.gif"></p>
                <p align="justify"><font size="4">La idea b&aacute;sica se ve muy bien en el dominio de la frecuencia. En la figura de arriba se ven las se&ntilde;ales S1 y S2 que salen de los altavoces. La se&ntilde;al Y1 que alcanza la oreja izquierda es una mezcla de S1 y el “crosstalk” de S2. As&iacute; para ser m&aacute;s precisos Y1 = H11 S1 + H12 S2, donde H11 es la HRTF entre el altavoz izquierdo y la oreja izquierda y H12 es la HRTF entre el altavoz derecho y la oreja izquierda. Similarmente Y2 = H21 S1 + H22 S2. Si pudi&eacute;ramos usar auriculares podr&iacute;amos saber Y1e Y2, que son las se&ntilde;ales que recibimos en los dos o&iacute;dos respectivamente. El problema es encontrar las se&ntilde;ales apropiadas S1 y S2 que nos dan los resultados deseados. Esto matem&aacute;ticamente es bastante sencillo, simplemente invertir las ecuaciones: </font> </p>
                <p align="center"><img width="332" height="67" src="Imagenes/hrtf_clip_image003.gif"></p>
                <p align="justify"><font size="4">En la pr&aacute;ctica invertir las matrices no es tan sencillo. </font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; A frecuencias bajas, todas las funciones de transferencia son pr&aacute;cticamente id&eacute;nticas (ya vimos por qu&eacute;), y por lo tanto la matriz es singular (el determinante es cero). Afortunadamente, en recintos reverberantes, la informaci&oacute;n de baja frecuencia no es muy importante para la localizaci&oacute;n. </font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; Una soluci&oacute;n exacta produce una respuesta al impulso muy larga. Este problema es notable cuanto m&aacute;s alejada est&eacute; la fuente con respecto el punto medio entre los dos altavoces. </font> </p>
                <p align="justify"><font size="4">&#149;&nbsp; El resultado depende de la posici&oacute;n relativa del usuario con respecto a los altavoces. (Los resultados &oacute;ptimos se obtienen en un punto llamado “sweet spot”, que es una posici&oacute;n asumida cuando las ecuaciones anteriores son invertidas. </font> </p>
                <p align="justify"><font size="4">Si se hace bien, la t&eacute;cnica <em>“crosstalk-canceled stereo” </em> puede ser muy efectiva, consiguiendo variar tanto el azimut como la elevaci&oacute;n. La fuente la podemos situar fuera de la l&iacute;nea que une los dos altavoces. </font> </p>
                <p><font size="4"><span lang="es">S</span>in embargo, puesto que el stereo cross-talk-cancelled aun necesita se&ntilde;ales binaural, limitaremos nuestras observaciones permanentes a sistemas auriculares<span lang="es">.</span> </font></p>
                <h1 class="style3"><font size="5" face="Comic Sans MS">Registro de la posici&oacute;n de la cabeza<span lang="es">.</span> </font> </h1>
                <p align="justify"><font size="4">Cuando utilizamos los auriculares, si el usuario se mueve o mueve la cabeza, las se&ntilde;ales enviadas a los auriculares no var&iacute;an, produciendo as&iacute; la sensaci&oacute;n de que la fuente de sonido se mueve con el usuario. Esto no se puede dar en aplicaciones de realidad virtual. Es m&aacute;s, incluso algunos efectos espaciales son debilitados o incluso totalmente anulados. Esto es particularmente un problema para fuentes que se suponen directamente en frente o detr&aacute;s del usuario porque la velocidad de variaci&oacute;n de las variables, es mucho m&aacute;s r&aacute;pida para esas direcciones. As&iacute;, un resultado t&iacute;pico es que las fuentes aparezcan demasiado cerca o incluso dar la impresi&oacute;n que se originan en la cabeza. </font> </p>
                <p align="justify"><font size="4">Una soluci&oacute;n posible es usar un aparato que tenga constancia de la posici&oacute;n relativa de la cabeza con respecto las fuentes &oacute; fuente (“head tracker”) y que lo haga peri&oacute;dicamente; variando las HRIR's seg&uacute;n los datos obtenidos. En este sentido, a la hora de dise&ntilde;ar, a parte del coste, fiabilidad y precisi&oacute;n, otros dos aspectos han de ser tenidos en cuenta: </font> </p>
                <ul>
                  <li>
                    <p align="justify"><font size="4"><strong>Retardo permitido (Allowable latency)</strong>. El retardo es el tiempo entre el movimiento y cuando la HRIR corregida se usa. La experiencia nos dice que deber&iacute;a ser como m&aacute;ximo de 50 mseg. </font>                 
                  </li>
                  <li>
                    <p align="justify"><font size="4"><strong>Transiciones inadecuadas (Unwanted transients)</strong>. Al cambiar las HRIR por otras m&aacute;s adecuadas, en el proceso de cambio se pueden escuchar ‘clicks'. Es deseable una transici&oacute;n suave en estos casos. </font>                 
                  </li>
                </ul>
                <h1 class="style3"><font size="5" face="Comic Sans MS">Versiones Modeladas y experimentales de HRTF's<span lang="es">.</span> </font> </h1>
                <p align="justify"><font size="4">Debido a que las funciones HRTF's son muy complejas, la mayor&iacute;a de los sistemas desarrollados han dependido de funciones medidas experimentalmente con el KEMAR. Sin embargo, los efectos de elevaci&oacute;n y de azimut son particularmente sensibles a las diferencias individuales. Han surgido cuatro aproximaciones diferentes para estas funciones: </font> </p>
                <ol>
                  <li>
                    <p align="justify"><font size="4"><strong>Usar una HRTF est&aacute;ndar.</strong> Sin embargo, esto da unos resultados pobres en un porcentaje de la poblaci&oacute;n, pero es el &uacute;nico sistema pr&aacute;ctico para productos baratos. En la actualidad, ni el IEEE, ni ACM o la AES han definido un est&aacute;ndar HRTF, pero parece que una compa&ntilde;&iacute;a como Microsoft o Intel crear&aacute;n uno <a href="#_ftn1" name="_ftnref1"></a>. </font>                 
                  </li>
                  <li>
                    <p align="justify"><font size="4"><strong>Usar un set de HRTF's est&aacute;ndar</strong>. Esto requiere medir HRTF's para un grupo peque&ntilde;o de personas que representan distintos modelos de la poblaci&oacute;n, y dando as&iacute; una forma sencilla de seleccionar al usuario lo que se adecue mejor a &eacute;l. Hasta la fecha no existe. </font>                 
                  </li>
                  <li>
                    <p align="justify"><font size="4"><strong>Usar un HRTF individualizado</strong>. Esto requiere medir la HRTF's del usuario con el considerable tiempo empleado para usarlo. Aunque es pesado y probablemente no viable, es claro que es el que mejores resultados da. </font>                 
                  </li>
                </ol>
                <p align="justify"><font size="4">Usar un modelo HRTF conteniendo par&aacute;metros que pueden ser adaptados a cada individuo. Para estos modelos sugerimos ir a la bibliograf&iacute;a, ya que es un tema extenso y que se sale del prop&oacute;sito de este trabajo. </font></p>
                <!-- InstanceEndEditable --><BR>
&nbsp;  <BR>
                <P class=pie align=center>&nbsp;                </P>
                <P class=pie align=center><BR>
&copy; 2004 Ingenier&iacute;a de Ondas </P>              </TR>
          </TBODY>
        </TABLE>
    </TR>
  </TBODY>
</TABLE>

</body>
<!-- InstanceEnd --></html>
