<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><!-- InstanceBegin template="/Templates/Plantilla.dwt" codeOutsideHTMLIsLocked="false" -->
<head>
<LINK rel=stylesheet href="style.css" type="text/css" title="Radioclub">
<!-- InstanceBeginEditable name="doctitle" -->
<title>Untitled Document</title>
<!-- InstanceEndEditable -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<!-- InstanceBeginEditable name="head" -->
<style type="text/css">
<!--
.style2 {color: #006699}
-->
</style>
<style type="text/css">
<!--
.style4 {
	font-size: 10px;
	font-weight: bold;
}
-->
</style>
<style type="text/css">
<!--
.style5 {font-size: 10px}
-->
</style>
<!-- InstanceEndEditable -->
<style type="text/css">
<!--
.style1 {
	color: #000000;
	font-weight: bold;
}
-->
</style>
<link href="style.css" rel="stylesheet" type="text/css">
</head>

<body>
<BASEFONT face=tahoma,verdana,helvetica,arial>
<TABLE cellSpacing=0 cellPadding=0 width=640 align=center bgColor=#ffffff>
  <TBODY>
    <TR>
      <TD class=wide>
        <TABLE cellSpacing=0 cellPadding=0 width=760 bgColor=#ffffff border=0>
          <TBODY>
            <TR>
              <TD class=dow><img 
            src="Imagenes/logo1.jpg" alt=RadioClub border=0 
           align="middle">
              <TD class=dow><img 
            src="Imagenes/logo2.jpg" alt=RadioClub width="400" height="60" border=0 
            align=left> 
            </TR>
          </TBODY>
        </TABLE>
    <TR>
      <TD class=wide>
        <TABLE cellSpacing=0 cellPadding=0 width=760 border=0><!--DWLayoutTable-->
          <TBODY>
            <TR>
              <TD vAlign=top align=left width=130>
                <TABLE cellSpacing=0 cellPadding=0 width=130>
                  <TBODY>
				  <TR>
                      <TD height="63" bgColor=#FFFFFF class=diz>
                        <P class=lin>&nbsp;</P>
                    <TR>
                    <TR>
                      <TD class=diz bgColor=#FF0000>
                        <P class=lin><span class="style1">Apartados </span></P>
                    <TR>
                      <TD class=diz bgColor=#FFCCCC>                        <P class=lst><a href="index.htm">0. Inicio</a> <br>
                        <A 
                  href="Introduccion.htm?enlace=secciones/contenido_index.php">1. Introducci&oacute;n</A><BR>
                          <a href="csound.htm">2. Csound</a></p>
                        <P class=lst> <a href="funciones.htm">2.1 Funciones</a></p>
                        <P class=lst><a href="ejemplo0.htm">2.2. Ejemplos</a><BR>
                          <a href="eco.htm">3. Ecos y Rev.</a><br>
                          <a href="sonido3d.htm">4. Sonido 3D</a><br>
                          <a href="Ejemplos.htm">5.Ejemplos Csound</a><br> 
                          <a href="Bibliografia.htm">6.Bibliograf&iacute;a</a></p>
                        <P class=lst>&nbsp;</p>
                    <TR>
                      <TD class=diz bgColor=#FF0000>
                        <P class=lin><B><FONT color=#d80000>:</FONT>Contacta!!!!!</B></P>
                    <TR>
                      <TD class=diz bgColor=#FFCCCC>
                        <P class=lst> <a href="mailto:jpermar@ribera.tel.uva.es">jpermar@ribera.tel.uva.es </a> </P>
                        <P class=lst> <a href="mailto:acuedie@ribera.tel.uva.es">acuedie@ribera.tel.uva.es </a> <A href="http://www.augcyl.org/" target=_blank></A><br>
                        </P>
                    <TR>
                      <TD class=diz bgColor=#ffffff>
                        <P class=lst><BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                            <BR>
                        </P>
                    </TR>
                  </TBODY>
                </TABLE>
              <TD align=left valign="top" bgColor=#ffffff>
                <h2 align="left"><!-- InstanceBeginEditable name="EditRegion3" --><font face="Comic Sans MS" size="6"><span class="SpellE style2">ECOS Y REVERBERACIONES.</span></font><!-- InstanceEndEditable --> </h2>
                <!-- InstanceBeginEditable name="EditRegion4" -->
                <p align="center"><a name="_ftn11"></a></p>
                <p align="justify">Normalmente no somos conscientes de la gran cantidad de energ&iacute;a que proviene de las reflexiones. Incluso en el exterior, una cantidad apreciable proviene de reflexiones del suelo, de las estructuras que nos rodean y de la vegetaci&oacute;n. Nosotros s&oacute;lo nos damos cuenta de estas reflexiones cuando el retardo es mayor que 30 o 50 ms , e n ese tiempo , somos conscientes de este retardo . </p>
                <ul>
                  <li><a href="#_ftn1" name="_ftnref1">El Eco. </a></li>
                  <li><a href="#_ftn2" name="_ftnref2">La Reverberaci&oacute;n. </a></li>
                  <li><a href="#_ftn2" name="_ftnref3">C&aacute;mara Anecoica. </a></li>
                  <li><a href="#_ftn4" name="_ftnref4"> Localizaci&oacute;n del sonido. </a></li>
                </ul>
                <p align="justify"><strong><a name="_ftn1"></a>El ECO. </strong></p>
                <p align="justify">En la mitolog&iacute;a griega, eco significa ninfa de la monta&ntilde;a. El dios supremo Zeus, la persuadi&oacute; de entretener a su mujer, Hera, con una charla incesante, para que &eacute;sta no pudiese espiarlo. Irritada, Hera le quit&oacute; a Eco el poder de hablar, dej&aacute;ndole s&oacute;lo la facultad de repetir la &uacute;ltima s&iacute;laba de cada palabra que oyera. Un amor no correspondido por el bello Narciso, que amaba a su propia imagen reflejada, hizo que Eco languideciera hasta que s&oacute;lo qued&oacute; de ella su voz. </p>
                <p align="justify">Las ondas sonoras sufren una reflexi&oacute;n parcial al chocar con la superficie de un medio cualquiera de distinta densidad a la del medio en que se propagaban. Esta es la causa de una p&eacute;rdida de energ&iacute;a vibrante y en, consecuencia de amplitud; al disminuir &eacute;sta, la intensidad del sonido se hace menor. Las reflexiones sucesivas del sonido en capas atmosf&eacute;ricas de densidad diversa hacen que se amortig&uuml;e y se limite extraordinariamente su radio de percepci&oacute;n. </p>
                <p align="justify">Al reflejarse el sonido en un s&oacute;lido, por ejemplo un muro, la energ&iacute;a de la onda reflejada es la misma que la incidente y la p&eacute;rdida de intensidad es la que corresponde al aumento de distancia. </p>
                <p align="justify">Cuando la onda incidente y la reflejada impresionan el o&iacute;do del mismo observador con intermitencia suficiente para la percepci&oacute;n de los dos sonidos, se produce el fen&oacute;meno llamado ECO . </p>
                <p align="justify">El intervalo de tiempo m&iacute;nimo para que nuestro o&iacute;do perciba sonidos musicales es 0 . 1 segundos y 0.07 segundos para sonidos secos (palabras) . Si consideramos como velocidad del sonido a la temperatura de 20&ordm;C uno 340 m/s el espacio que debe recorrer la onda en su ida y vuelta del o&iacute;do al obst&aacute;culo es: <em>s = 0 . 1 x 340 = 34m </em>para sonidos musicales, en el caso de sonidos secos (palabras) el espacio que debe recorrer la onda en su ida y vuelta del o&iacute;do al obst&aacute;culo en las mismas condiciones es: <em>s = 0 .07 x 340 = 23.8 m. </em></p>
                <p align="justify">La distancia m&iacute;nima entre el o&iacute;do y la superficie reflectora debe ser alrededor de 17 m. para que se produzca eco. </p>
                <table cellpadding="0" cellspacing="0">
                  <tr>
                    <td width="50%"><p align="center"><img src="Imagenes/eco_sineco.jpg" width="200" height="257"></p></td>
                    <td width="50%"><p align="center"><img src="Imagenes/eco_coneco.jpg" width="300" height="146"></p>
                        <p align="center">Fig.2. Existe Eco. </p></td>
                  </tr>
                  <tr>
                    <td width="50%"><p align="center">Fig.1. No existe eco.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p></td>
                    <td width="50%"></td>
                  </tr>
                </table>
                <p align="justify">El eco puede presentarse como un problema cuando se superponen los sonidos incidentes y los reflejados en las paredes dando una interferencia especial a la que se denomina <em>reverberaci&oacute;n </em>, y, en consecuencia, se oye mal. </p>
                <a href="#_ftn11" name="_ftn6">Arriba </a>
                <p align="justify"><strong><a name="_ftn2"></a>LA REVERBERACI&Oacute;N. </strong></p>
                <p align="justify">La reverberaci&oacute;n es el fen&oacute;meno de sucesivas reflexiones del sonido en distintas superficies. Se produce reverberaci&oacute;n cuando las ondas reflejadas llegan al oyente antes de la extinci&oacute;n de la onda directa, es decir, en un tiempo menor que el de persistencia ac&uacute;stica del sonido. Este fen&oacute;meno es de suma importancia, ya que se produce en cualquier recinto en el que se propaga una onda sonora. El oyente no s&oacute;lo percibe la onda directa, sino las sucesivas reflexiones que la misma produce en las distintas superficies del recinto. Controlando adecuadamente este efecto, se contribuye a mejorar las condiciones ac&uacute;sticas de los locales tales como teatros, salas de concierto y, en general, todo tipo de salas. La caracter&iacute;stica que define la reverberaci&oacute;n de un local se denomina tiempo de reverberaci&oacute;n. Se define como el tiempo que transcurre hasta que la intensidad del sonido queda reducida a una millon&eacute;sima de su valor inicial. </p>
                <p align="justify">Este tiempo de reverberaci&oacute;n no debe ser demasiado largo, por los inconvenientes antes nombrados. Tampoco debe ser demasiado corto pues, entonces, en una gran sala de espect&aacute;culos, por ejemplo, no captar&iacute;a los sonidos el auditorio entero. El tiempo de reverberaci&oacute;n &oacute;ptimo es de 1 a 2 segundos. En f&aacute;bricas, talleres, etc., conviene, para evitar molestias auditivas, un tiempo de reverberaci&oacute;n muy corto. </p>
                <p align="justify">Se evita tal fen&oacute;meno por medio de cuerpos absorbentes del sonido, que, reflej&aacute;ndose en ellos, pierde un tanto por ciento determinado de su intensidad en cada reflexi&oacute;n. </p>
                <a href="#_ftn11" name="_ftn6">Arriba </a>
                <p align="justify"><strong><a name="_ftn3"></a>C&Aacute;MARA ANECOICA. </strong></p>
                <p align="justify">Existen habitaciones llamadas <em>anecoic a </em> (Fig.3.) que tienen un recubrimiento especial que absorbe toda la energ&iacute;a proveniente de las reflexiones (c&aacute;maras sin eco) , as&iacute; s&oacute;lo escuchamos el sonido tal y como se produce, la mayor&iacute;a de las personas, se quedan sorprendidas de lo seco que son los sonidos en estas c&aacute;maras. </p>
                <p align="justify">Esta c&aacute;mara est&aacute; dise&ntilde;ada para minimizar los efectos de los sonidos y el ruido externo. El sonido externo se evita mediante el aislamiento f&iacute;sico de la estructura, filtros ac&uacute;sticos en los conductos de ventilaci&oacute;n y los anchos muros. </p>
                <p align="justify"> Las superficies superiores est&aacute;n cubiertas de material absorbente del sonido - como fibra de cristal o lana mineral - tanto en planchas como en cubos verticales y horizontales. El techo y el suelo est&aacute;n rellenos de forma similar; con una estrecha malla met&aacute;lica justo por encima del suelo, que proporciona una superficie &oacute;ptima para poder andar. La reflexi&oacute;n del sonido se puede reducir de uno a 1000 en esta habitaci&oacute;n, simulando las condiciones ac&uacute;sticas de espacio libre no obstruido </p>
                <p align="left"><img src="Imagenes/ecos_camara_anecoica.jpg" width="518" height="458"></p>
                <p align="center">Fig.3. C&aacute;mara anecoica. </p>
                <p align="justify"><a href="#_ftn11" name="_ftn6">Arriba </a></p>
                <p><strong><a name="_ftn4"></a>LOCALIZACI&Oacute;N DEL SONIDO. </strong></p>
                <p align="justify">Puesto que el sonido reflejado es tan com&uacute;n, cabe preguntarnos por qu&eacute; estas reflexiones no interfieren con nuestra habilidad de localizar el sonido. La respuesta viene en que nos adaptamos r&aacute;pidamente a los nuevos entornos y nuestros sistema auditivo usa mecanismos para suprimirlos. El hecho de localiza r en base a qu&eacute; oreja percibe antes el sonido se conoce como el efecto de procedencia ( <em>precedente effect </em>) o la ley del primer frente de onda (" <em>law of the first Wavefront </em>"). Esto no quiere decir que no tomamos informaci&oacute;n inconscientemente para estimar lo lejos que est&aacute; el sonido. Aunque a menos que la reverberaci&oacute;n es muy pronunciada, las reflexiones tiene poco peso a la h ora de localizar el sonido. </p>
                <p align="justify">Las primeras teor&iacute;as de localizaci&oacute;n provienen de la cl&aacute;sica "teor&iacute;a d&uacute;plex" ( <em>Teor&iacute;a de </em><em> Rayleigh </em>), la cual enfatiza el rol de dos componentes fundamentales de la se&ntilde;al de audio que llega nuestros o&iacute;dos: la diferencia interaural en tiempo (ITD) y la diferencia interaural de intensidad (IID) ( F ig. 4. ). Esta teor&iacute;a resulta incompleta, pues no tiene en cuenta la habilidad que poseen las personas de localizar sonidos sobre el plano medio vertical (sobre sus cabezas), en frente o detr&aacute;s, donde las diferencias interaurales son m&iacute;nimas para estas posiciones . </p>
                <p align="center"><img src="Imagenes/ecos_ITD_IID.gif" width="299" height="360"></p>
                <p align="center"> Fig. 4. Componentes fundamentales de la se&ntilde;al de audio que llega a los o&iacute;dos (Teor&iacute;a de Rayleigh). </p>
                <p align="justify">Similarmente , cuando una persona escucha un est&iacute;mulo con auriculares en los que solo est&aacute;n incluidas las diferencias interaurales en tiempo y amplitud, el sonido resultante aparece como si estuvieran dentro de la cabeza del oyente y no en el espacio. Inclusive existe una p&eacute;rdida de la sensaci&oacute;n de elevaci&oacute;n, y notable confusi&oacute;n de atr&aacute;s-adelante de la fuente sonora presentada. As&iacute;, la simulaci&oacute;n teniendo como par&aacute;metro este modelo es deficiente. </p>
                <p align="justify">Muchos estudios sugieren que esta deficiencia en la teor&iacute;a d&uacute;plex reflejan la importante contribuci&oacute;n en la localizaci&oacute;n que produce el filtrado dependiente de la direcci&oacute;n que ocurre cuando un sonido arriba al o&iacute;do externo o pabell&oacute;n de la oreja. Un sonido se propaga desde una fuente generadora hasta los o&iacute;dos del receptor, pero las reflexiones y refracciones impuestas por la morfolog&iacute;a f&iacute;sica de la cabeza tienden a alterar el sonido de manera sutil. Estos efectos son dependientes de la frecuencia de la fuente sonora. Este filtrado tambi &eacute; n varia en funci&oacute;n de la posici&oacute;n del espacio de la fuente. </p>
                <p align="justify">Experimentos muestran que la respuesta del pabell&oacute;n de la oreja es altamente dependiente de la direcci&oacute;n del sonido <strong><a href="#_ftn5" name="_ftnref5">[1] </a></strong> y que la ausencia del pabell&oacute;n degrada la capacidad de localizaci&oacute;n y externalizaci&oacute;n (fuera de la cabeza) del sonido. As&iacute;, la forma y tama&ntilde;o de la oreja, inclusive la cabeza y el torso, imponen un complejo efecto en las se&ntilde;ales de audio, atenuando y cambiando la fase selectivamente para cada frecuencia y cada posici&oacute;n del espacio. La adici&oacute;n de un procesamiento que imponga todas estas modificaciones en una se&ntilde;al de audio, puede lograr un sentido mas amplio de espacializaci&oacute;n. </p>
                <p align="justify">Existen muchos efectos acumulativos desde que el sonido sale de la fuente hasta que este arriba al t&iacute;mpano, pero todos ellos pueden ser expresados en una sola operaci&oacute;n de filtrado, parcialmente similar a la que realiza un ecualizador gr&aacute;fico de audio. Se han realizado varias mediciones sobre personas reales y maniqu&iacute;es con morfolog&iacute;a humana de estas caracter&iacute;sticas de filtrado, b&aacute;sicamente poniendo peque&ntilde;os micr&oacute;fonos tan cerca como fuera posible del t&iacute;mpano. Bajo las condiciones de una c&aacute;mara anecoica, una se&ntilde;al anal&iacute;tica o un impulso brev&iacute;simo es emitido de una posici&oacute;n determinada del espacio y este impulso es grabado con los micr&oacute;fonos. Un pulso posee componentes frecuenciales en casi todo el espectro &uacute;til, as&iacute; que el resultado obtenido en la grabaci&oacute;n contendr&aacute; la funci&oacute;n de transferencia impuesta por el o&iacute;do , r ealizando la transformada de Fourier se pueden cuantificar estos valores. </p>
                <p align="justify">As&iacute; en esta grabaci&oacute;n realizada simult&aacute;neamente en ambos o&iacute;dos , se l a s denomina <em>grabaciones binaurales , </em> esta inmersa la informaci&oacute;n de diferencia de intensidad, retardo en tiempo, atenuaci&oacute;n frecuencial y cambio de fase para la posici&oacute;n del espacio de la fuente emisora, como si fuera una huella dactilar de las caracter&iacute;sticas f&iacute;sicas del o&iacute;do del usuario sometido a la grabaci&oacute;n. La representaci&oacute;n en el dominio del tiempo de estas caracter&iacute;sticas asociadas al o&iacute;do es llamada gen&eacute;ricamente filtro FIR (Finite Impulse Response) y la representaci&oacute;n en el dominio frecuencial de estas funciones de transferencia del o&iacute;do o huella dactilar ac&uacute;stica es conocida como HRTF (Head Related Transfer Functions). </p>
                <p align="center"><img src="Imagenes/eco_localizac.gif" width="386" height="336"></p>
                <p align="center">Fig .5. Representaci&oacute;n de las variables percibidas en la localizaci&oacute;n espacial de una fuente de sonido desde la perspectiva del oyente. </p>
                <p align="justify">As&iacute; filtrando un sonido arbitrario con estos filtros HRTF, se puede imponer una caracter&iacute;stica espacial al sonido de tal manera que al ser presentado este con auriculares, parece emanar de la posici&oacute;n deseada en el espacio ( F ig .5. ). La localizaci&oacute;n depende de otros factores tal como: </p>
                <ul>
                  <li>
                    <p align="justify">contenido espectral de la fuente original, </p>
                  </li>
                  <li>
                    <p align="justify">ancho de banda de la fuente, </p>
                  </li>
                  <li>
                    <p align="justify">diferencias entre la HRTF del usuario destino y de la persona de la cual se tomaron las mediciones, etc. </p>
                  </li>
                </ul>
                <p align="justify"><a href="#_ftn11" name="_ftn4">Arriba </a></p>
                <p>Vamos a mostrar a continuaci&oacute;n alg&uacute;n ejemplo de c&oacute;digos csound y su resultado del estudio de reverberacion : </p>
                <p>&nbsp;</p>
                                <table border="1" cellpadding="0" cellspacing="0" style="border-collapse: collapse" bordercolor="#111111" width="486" id="AutoNumber1" bgcolor="#66CCFF" height="252">
                    <tr>
                      <td align="center" height="42" colspan="2"><div align="left"><span class="style4" lang="es"> REVERBERACI&Oacute;N</span></div></td>
                      <td width="141" align="center" height="40"><p class="style4">ARCHIVO</p>
                      <p class="style4">ORQUESTA (.org)</p></td>
                      <td width="229" align="center" height="40"><p class="style4">ARCHIVO</p>
                      <p class="style4"> PARTITURA (.sco)</p></td>
                      <td width="212" align="center" height="40"><span class="style4">RESULTADO</span></td>
                    </tr>
                    <tr>
                      <td width="42" align="center" height="103" rowspan="4"><span class="style4"> <font face="Times New Roman">&copy;Csound</font></span></td>
                      <td width="139" align="center" height="22"><span class="style5" lang="es">Sin reverberaci&oacute;n</span><span class="style5">.</span></td>
                      <td height="22" width="141">
                        <p align="center" class="style5"><span lang="es">--</span></td>
                      <td height="22" width="229">
                        <p align="center" class="style5"><span lang="es">--</span></td>
                      <td height="22" width="212">
                        <p align="center" class="style5">
                      <!--    <embed src="ejemplos/Csound/speech1.aif" width="128" height="24" autoplay="false" controller="true" cache="true"></embed>  -->                        <audio controls>
                        <audio controls>
                          <source src="ejemplos/Csound/speech1.aif" type="audio/aiff">
                          Your browser does not support the audio element.
                        </audio>
                          Si no estás utilizando Safari tienes que escuchar el audio bajándolo y escucharlo con un reproductor compatible con .aiff como VLC (vlc.org)
                          <a href="ejemplos/Csound/speech1.aif">Link a archivo</a>
                      </td>
                    </tr>
                    <tr>
                      <td width="139" align="center" height="24"><span class="style5" lang="es">Reverberaci&oacute;n baja (<a href="figuras/2312.gif">diagrama</a>).</span></td>
                      <td height="24" width="141">
                        <p align="center" class="style5"><a href="ejemplos/Csound/2312.orc"><span lang="es"> 2312</span>.orc</a></td>
                      <td height="24" width="229">
                        <p align="center" class="style5"><a href="ejemplos/Csound/2312.sco"><span lang="es"> 2312</span>.sco</a></td>
                      <td height="24" width="212">
                        <p align="center" class="style5">
                     <!--     <embed src="ejemplos/Csound/rev12.aiff" width="128" height="24" autoplay="false" controller="true" cache="true"></embed>-->
                                                  <audio controls>
                          <source src="ejemplos/Csound/rev12.aiff" type="audio/aiff">
                          Your browser does not support the audio element.
                        </audio>
                          Si no estás utilizando Safari tienes que escuchar el audio bajándolo y escucharlo con un reproductor compatible con .aiff como VLC (vlc.org)
                          <a href="ejemplos/Csound/rev12.aiff">Link a archivo</a>
                      </td>
                    </tr>
                    <tr>
                      <td width="139" align="center" height="24"><span class="style5" lang="es">Reverberaci&oacute;n media (<a href="figuras/2310.gif">diagrama</a>)</span></td>
                      <td height="24" width="141">
                        <p align="center" class="style5"><a href="ejemplos/Csound/2310.orc"><span lang="es"> 2310</span>.orc</a></td>
                      <td height="24" width="229">
                        <p align="center" class="style5"><a href="ejemplos/Csound/2310.sco"><span lang="es"> 2310</span>.sco</a></td>
                      <td height="24" width="212">
                        <p align="center" class="style5">
                      <!--    <embed src="ejemplos/Csound/rev10.aiff" width="128" height="24" autoplay="false" controller="true" cache="true"></embed>-->
                                                  <audio controls>
                          <source src="ejemplos/Csound/rev10.aiff" type="audio/aiff">
                          Your browser does not support the audio element.
                        </audio>
                          Si no estás utilizando Safari tienes que escuchar el audio bajándolo y escucharlo con un reproductor compatible con .aiff como VLC (vlc.org)
                          <a href="ejemplos/Csound/rev10.aiff">Link a archivo</a>
                      </td>
                    </tr>
                    <tr>
                      <td width="139" align="center" height="24"><span class="style5" lang="es">Reverberaci&oacute;n alta.</span></td>
                      <td height="24" width="141">
                        <p align="center" class="style5"><a href="ejemplos/Csound/2309.orc"><span lang="es"> 2309</span>.orc</a></td>
                      <td height="24" width="229">
                        <p align="center" class="style5"><a href="ejemplos/Csound/2309.sco"><span lang="es"> 2309</span>.sco</a></td>
                      <td height="24" width="212">
                        <p align="center" class="style5">
                         <!-- <embed src="ejemplos/Csound/rev9.aiff" width="128" height="24" autoplay="false" controller="true" cache="true"></embed>-->
                                                  <audio controls>
                          <source src="ejemplos/Csound/rev9.aiff" type="audio/aiff">
                          Your browser does not support the audio element.
                        </audio>
                          Si no estás utilizando Safari tienes que escuchar el audio bajándolo y escucharlo con un reproductor compatible con .aiff como VLC (vlc.org)
                          <a href="ejemplos/Csound/rev9.aiff">Link a archivo</a>
                      </td>
                    </tr>
                  </table>
                
                <p>&nbsp;</p>
                <p>&nbsp;</p>
                <p><br>
                </p>
                <p><a href="file:///C:/Documents%20and%20Settings/chemita/Mis%20documentos/Webs/trabajo/ecos.htm#_ftnref5" name="_ftn5">[1] </a> Blauert ,J. 1983, Spatial Hearing: the Psychophysics of Human Sound Localization, Cambridge, MA, MIT Press </p>
                <p>&nbsp;</p>
                <!-- InstanceEndEditable --><BR>
&nbsp;  <BR>
                <P class=pie align=center>&nbsp;                </P>
                <P class=pie align=center><BR>
&copy; 2004 Ingenier&iacute;a de Ondas </P>              </TR>
          </TBODY>
        </TABLE>
    </TR>
  </TBODY>
</TABLE>

</body>
<!-- InstanceEnd --></html>
